{
    "Results": {
        "categorical_accuracy": 0.915251612663269,
        "loss": 0.2858193814754486,
        "val_loss": 0.28117385506629944,
        "TEST_ACC": 0.913151364764268
    },
    "Hyperparameters": {
        "n_epochs": 1000,
        "learning_rate": 0.001,
        "batch_size": 1024,
        "n_neurons_per_hlayer": [
            50,
            25,
            50
        ],
        "optimizer": "<keras.optimizers.optimizer_v2.nadam.Nadam object at 0x7fc294843d90>",
        "model": {
            "class_name": "Sequential",
            "config": {
                "name": "Feedforward_NN",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                29
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_9"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_36",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_28",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_37",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 25,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_29",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_38",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_30",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_39",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 4,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            },
            "keras_version": "2.9.0",
            "backend": "tensorflow"
        }
    }
}