{
    "Results": {
        "categorical_accuracy": 0.8816779255867004,
        "loss": 0.4207189679145813,
        "val_loss": 0.4069681465625763,
        "TEST_ACC": 0.8734491315136477
    },
    "Hyperparameters": {
        "n_epochs": 700,
        "learning_rate": 0.01,
        "batch_size": 1024,
        "n_neurons_per_hlayer": [
            25,
            50,
            25
        ],
        "optimizer": "<keras.optimizers.optimizer_v2.gradient_descent.SGD object at 0x7fc50c0aa370>",
        "model": {
            "class_name": "Sequential",
            "config": {
                "name": "Feedforward_NN",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                29
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_2"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 25,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0020000000949949026
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_3",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0020000000949949026
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_4",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_6",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 25,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0020000000949949026
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_5",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_7",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 4,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0020000000949949026
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            },
            "keras_version": "2.9.0",
            "backend": "tensorflow"
        }
    }
}