{
    "Results": {
        "categorical_accuracy": 0.9040862321853638,
        "loss": 0.3137966990470886,
        "val_loss": 0.2972922921180725,
        "TEST_ACC": 0.9081885856079405
    },
    "Hyperparameters": {
        "n_epochs": 1000,
        "learning_rate": 0.001,
        "batch_size": 512,
        "n_neurons_per_hlayer": [
            25,
            50,
            25
        ],
        "optimizer": "<keras.optimizers.optimizer_v2.rmsprop.RMSprop object at 0x7fc312766ee0>",
        "model": {
            "class_name": "Sequential",
            "config": {
                "name": "Feedforward_NN",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                29
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_6"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_23",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 25,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_18",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_24",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_19",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_25",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 25,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_20",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.1,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_26",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 4,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.0010000000474974513
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            },
            "keras_version": "2.9.0",
            "backend": "tensorflow"
        }
    }
}